// №1 ⊗jsPmLpPrm Выведите с помощью цикла столбец чисел от 1 до 100.

// №2 ⊗jsPmLpPrm Выведите с помощью цикла столбец чисел от 100 до 1

// №3 ⊗jsPmLpPrm Выведите с помощью цикла столбец четных чисел от 1 до 100.

// №4 ⊗jsPmLpPrm Заполните массив 10-ю иксами с помощью цикла.

// №5 ⊗jsPmLpPrm Заполните массив числами от 1 до 10 с помощью цикла.

// № 6 Дан массив с числами. С помощью цикла выведите только те элементы массива, которые больше нуля и меньше 10-ти.

// № 7 Дан массив с числами. С помощью цикла проверьте, что в нем есть элемент со значением 5.

// № 8 Дан массив с числами. С помощью цикла найдите сумму элементов этого массива

// № 9 Дан массив с числами. С помощью цикла найдите сумму квадратов элементов этого массива.

// № 10 Дан массив с числами. Найдите среднее арифметическое его элементов.

// № 11 Напишите скрипт, который будет находить факториал числа. Факториал - это произведение всех целых чисел от единицы до заданного числа.

// № 12 Заполните массив числами от 10 до 1 с помощью цикла.

// № 13 Дан массив с числами. Числа могут быть положительными и отрицательными. Найдите сумму положительных элементов массива.

// № 14 Дан массив числами.Выведите на экран только те числа из массива, которые начинаются на цифру 1, 2 или 5

// № 15 Дан массив с числами. Выведите элементы этого массива в обратном порядке

// № 16 Дан массив с числами. С помощью цикла выведите на экран все элементы, значение которых совпадает с их порядковым номером в массиве.

// № 17 Дан массив с числами. С помощью цикла for и функции document.write выведите каждый элемент массива с новой строки. Используйте для этого тег br.

// № 18 Дан массив с числами. С помощью цикла for и функции document.write выведите каждый элемент массива в отдельном абзаце.

// № 19 Составьте массив дней недели. С помощью цикла for выведите все дни недели, а выходные дни выведите жирным.

// № 20 Составьте массив дней недели. С помощью цикла for выведите все дни недели, а текущий день выведите курсивом. Номер текущего дня должен храниться в переменной day.

// № 21 Дан следующий объект с работниками и их зарплатами.Увеличьте зарплату каждого работника на 10%.

// № 22 Модифицируйте предыдущую задачу так, чтобы зарплата увеличивалась только тем работникам, у которых она меньше или равна 400.

// № 23  С помощью этих массивов создайте новый объект, сделав его ключами элементы первого массива, а значениями - элементы второго.

// № 24 Найдите сумму ключей этого объекта и поделите ее на сумму значений.

// № 25 Запишите ключи этого объекта в один массив, а значения - в другой.

// № 26 Дан следующий объект.Запишите в новый массив элементы, значение которых начинается с цифры 1 или цифры 2. То есть у вас в результате получится вот такой массив:[

// № 27 Дан следующий массив.Создайте из этого массива следующий объект:

// № 28 Дан следующий массив:let arr = ['a', 'b', 'c', 'd', 'e'];Создайте из этого массива следующий объект:{'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5};